package com.example.hmohamadi.ebooklibrary;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class AboutUsActivity extends AppCompatActivity {
private TextView txtViewAboutUs;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_about_us);
        txtViewAboutUs= findViewById(R.id.about_us_txtAboutUs);
        txtViewAboutUs.setMovementMethod(new ScrollingMovementMethod());
        String content="دفتر حضرت آیت الله العظمی صانعی مدظله  (قــم )\n" +
                "\n" +
                "بلوار شهيد محمد منتظري ، کوچه هشتم ، پلاک 4\n" +
                "\n" +
                "کدپستی : 3713744369\n" +
                "\n" +
                "صندوق پستی : 37185557\n" +
                "\n" +
                "تلفن\u200Cهای تماس :2 ـ 60 16 3783 / 67 47 3774 / 10 40 3774 / 4009 3774 ( 025 )\n" +
                "\n" +
                "نمابر : 37735080 ( 025 )\n" +
                "\n" +
                "==================\n" +
                "\n" +
                "آدرس دفاتر حضرت آية الله العظمى صانعى\n" +
                "\n" +
                "در شهرستان ها\n" +
                "\n" +
                "آدرس دفتر تهران(دفتر شماره 1)\n" +
                "\n" +
                "كارگرجنوبی، بالاتر از میدان پاستور ( به طرف انقلاب )، خیابان شهید سرخابی ، نبش کوچه شهید شاطرپور، پلاک 1\n" +
                "\n" +
                "کدپستی : 1316973114\n" +
                "\n" +
                "نمابر : 66409278 ( 021 )\n" +
                "\n" +
                "تلفن\u200Cهای تماس : 5 - 4001 56 66 ( 021 )\n" +
                "\n" +
                "*************\n" +
                "\n" +
                "آدرس دفتر تهران )دفتر شماره 2)\n" +
                "\n" +
                "تهران  پاسداران ابتدای نگارستان ۲(شهید کاشیها) پ ۳۷\n" +
                "\n" +
                "تلفن\u200Cهای تماس : 22768080 / 22768181 / 22884600 / 22885300\n" +
                "\n" +
                "نمابر : 22847095 ( 021 )\n" +
                "\n" +
                "*****************\n" +
                "\n" +
                "آدرس دفتر تهران(دفتر شماره 3)\n" +
                "\n" +
                "شهرک غرب ، بلوار دریا ، تقاطع پاک نژاد (نبش چهار راه پاک \u200Cنژاد به طرف مدیریت ) ، پلاک 178\n" +
                "\n" +
                "کدپستی : 1466943141\n" +
                "\n" +
                "تلفن\u200Cهای تماس : 88583415 / 88583425 / 88582697 (021)\n" +
                "\n" +
                "نمابر : 88580821 ( 021 )\n" +
                "\n" +
                "==================\n" +
                "\n" +
                "دفـاتر استان اصفهـان\n" +
                "\n" +
                "دفتر اصفهان (دفتر شماره 1)\n" +
                "\n" +
                "خيابان عبدالرزاق ، كوچه قصر ، پلاک 126\n" +
                "\n" +
                "کدپستی : 8148686613\n" +
                "\n" +
                "تلفن\u200Cهای تماس : 2 ـ 34497660 ( 031 )\n" +
                "\n" +
                "نمابر : 34493391 ( 031 )\n" +
                "\n" +
                "******************\n" +
                "\n" +
                "دفتر اصفهان(دفتر شماره 2)\n" +
                "\n" +
                "خیابان دانشگاه ، خیابان توحید ، کوچه شماره 2 ، پلاک 4\n" +
                "\n" +
                "کدپستی : 8173939481\n" +
                "\n" +
                "تلفنهای تماس : 36271093 / 36281917( 031 )\n" +
                "\n" +
                "********************\n" +
                "\n" +
                "دفتر اصفهان(شماره3)\n" +
                "\n" +
                "نشانی: نجف آباد - خیابان فردوسی شمالی، خیابان نوبهار، پلاک 21 (جنب فیزیوتراپی)\n" +
                "تلفن: 42621173 - 42616551 -031\n" +
                "==================\n" +
                "دفـتر استان خراسان رضوی (مشهـد مقدّس)\n" +
                "\n" +
                "آدرس دفتر مشهد مقدس\n" +
                "\n" +
                "چهارراه شهداء ، خيابان آیت الله بهجت ( آزادى ) ، کوچه بهجت 1 / 9 ( بينادل ) ، پلاك 16\n" +
                "\n" +
                "کدپستی : 9143786496\n" +
                "\n" +
                "تلفن\u200Cهای تماس :\n" +
                "\n" +
                "32251152 / 32222277 / 32210002 / 3 - 32243142 / 32230323 / 32222577\n" +
                "\n" +
                "نمابر: 32230324 ( 051 )\n" +
                "\n" +
                "*******************\n" +
                "\n" +
                "==================\n" +
                "\n" +
                "دفتر استان فارس (شيـراز)\n" +
                "\n" +
                "شاه چراغ\u200C(ع) ، بلوار شهيد آيت الله دستغيب ، روبروی پایانه اتوبوسرانی\n" +
                "\n" +
                "كدپستي : 7139863985\n" +
                "\n" +
                "تلفن\u200C\u200Cهای تماس :\n" +
                "\n" +
                "32243334 / 32243498 ( 071 )\n" +
                "\n" +
                "32222294 / 402 ـ 32230400\n" +
                "\n" +
                "نمابر : 32226700 ( 071 )\n" +
                "\n" +
                "==================\n" +
                "\n" +
                "دفتر استان مرکـزی ( اراک )\n" +
                "\n" +
                "خيابان ادب جو ، مقابل دبیرستان ریحانة النبی ( طالقانی سابق ) ، پلاك 8877\n" +
                "\n" +
                "کدپستی : 3814698877\n" +
                "\n" +
                "تلفن\u200Cهای تماس :\n" +
                "\n" +
                "32272200 / 32272300 / 33259777 ( 086 )\n" +
                "\n" +
                "نمابر : 33259777 ( 086 )\n" +
                "\n" +
                "==================\n" +
                "\n" +
                "دفتر استان آذربایجان شرقی (تبـریز)\n" +
                "\n" +
                "ميدان دانش سرا ، خيابان دانش سرا ، كوچه حاج عبدالعظيم، پلاک 4\n" +
                "\n" +
                "کدپستی :\u200C 5136975499\n" +
                "\n" +
                "تلفنهای تماس :\n" +
                "\n" +
                "35264626 / 3532023 ( 041 )\n" +
                "\n" +
                "نمابر : 35252774 ( 041 )\n" +
                "\n" +
                "==================\n" +
                "\n" +
                "دفتر استان گلستان (گـرگان)\n" +
                "\n" +
                "خیابان شهید رجائی، گلشن 2 ، گذر محله درب نو، منزل آقای قدس علوی\n" +
                "\n" +
                "کدپستی : 4913616583\n" +
                "\n" +
                "تلفن\u200Cهای تماس : 32233270 / 32332270 ( 017 )\n" +
                "\n" +
                "******************************************\n" +
                "\n" +
                "کلیه پرداخت ها از طریق سایت به صورت اینترنتی مقدور می باشد- بخش پرداخت وجوه شرعی\n" +
                "\n" +
                "شماره حسابها جهت واريز وجوهات شرعيه :\n" +
                "\n" +
                "صاحب حساب : حضرت آيت الله العظمي صانعي\n" +
                "بانک صادرات ـ شماره حساب سپهر : 0102374755004\n" +
                "بانک ملي ـ شماره حساب سيبا : 0101907621001\n" +
                "شماره کارت ملي جهت واريز کارت به کارت \n" +
                "6037-9972-3995-5561\n" +
                "شماره حساب ارزي – بانک ملي مرکزي قم – شعبه 2701 – شماره حساب : 22200270\n" +
                "شماره حساب جهت واريز کفارات، مظالم، صدقات و غيره :\n" +
                "صاحب حساب : دفتر حضرت آيت الله العظمي صانعي\n" +
                "بانک ملي ـ شماره حساب سيبا :\n" +
                "0105983593005\n" +
                "کفاره غيرعمد بابت هر روز : 2000تومان\n" +
                "شماره حساب برای پرداخت فطریه\n" +
                "\n" +
                "شماره حساب : 90017008942923\n" +
                "شماره شبا: 320560900170000894292003 IR\n" +
                "شماره کارت: 2926 - 0894 - 8615 – 6219\n" +
                "شماره حساب برای پرداخت کفارات\n" +
                "\n" +
                "شماره حساب : 90017008942922\n" +
                "\n" +
                "شماره شبا: 590560900170000894292002 IR\n" +
                "\n" +
                "شماره کارت: 2927- 0894- 8614- 6219\n" +
                "\n" +
                "شماره حساب جهت امور خیریه: 90017008942927\n" +
                "\n" +
                "شماره شبا: 210560900170000894292007 IR\n" +
                "\n" +
                "شماره کارت: 2922- 0894- 8619- 6219\n" +
                "\n" +
                "نزد بانک سامان شعبه قم کد9001 \n" +
                "به نام حضرت آیت الله العظمی صانعی\n" +
                "شماره حسابها جهت واريز عبادات (نماز و روزه)\n" +
                "\n" +
                "صاحب حساب: دفتر حضرت آية اللّه العظمى يوسف صانعى \n" +
                "شماره حساب سيبا – بانك ملى 0105983601000\n" +
                "يكسال نماز 000 - 200 1 تومان \n" +
                "يكماه روزه 000 - 800 تومان\n" +
                "يك ختم قرآن 000 - 200 تومان\n" +
                "نیابت حج تمتع:000/000/ 12 تومان\n" +
                "پاسخگويى به مسائل حج \n" +
                "حجت الاسلام و المسلمين احمدى – 09122510007 \n" +
                "امور ارتباطات و ملاقات \n" +
                "حجت الاسلام و المسلمين سعيدى – 37748491";
        txtViewAboutUs.setText(content);
    }
}
